app/Helpers/addon_helper.php

SELECT *
FROM `addons`
WHERE `unique_identifier` = 'course_bundle'
---
    function addon_status($unique_identifier = '')
	{
		$db = \Config\Database::connect();

		$result = $db->table('addons')
					 ->where('unique_identifier', $unique_identifier)
					 ->get()
					 ->getRowArray();