app/Helpers/common_helper.php

    function get_settings($key = '', $type = '')
    {
        $db = \Config\Database::connect();
        $row = $db->table('settings')->select('value')->where('key', $key)->get()->getRow();
---
SELECT `value`
FROM `settings`
WHERE `key` = 'timezone'

    function get_frontend_settings($key = '')
    {
        $db = \Config\Database::connect();
        $row = $db->table('frontend_settings')->select('value')->where('key', $key)->get()->getRow();
---
SELECT `value`
FROM `frontend_settings`
WHERE `key` = 'theme'

    function get_current_banner($key = '')
    {
        $db = \Config\Database::connect();
        $row = $db->table('frontend_settings')->select('value')->where('key', $key)->get()->getRow();
---
SELECT `value`
FROM `frontend_settings`
WHERE `key` = 'banner_image'