app/Helpers/multi_language_helper.php

    function language_setting(): string
    {
        $db = language_db();

        $row = $db->table('settings')
            ->select('value')
            ->where('key', 'language')
            ->get()
            ->getRowArray();
---
SELECT `value`
FROM `settings`
WHERE `key` = 'language'

    function translate_phrase_from_db(string $phrase, string $languageCode): string
    {
        $db = language_db();
        $languageCode = strtolower($languageCode ?: 'english');
        $key = language_key($phrase);

        language_ensure_column($languageCode);

        $row = $db->table('language')
            ->where('phrase', $key)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `language`
WHERE `phrase` = 'home'