app/Views/frontend/default-new/header_lg_device.php

SELECT *
FROM `ebook_category`
---
            </a>
            <ul class="navbarHover">
              <?php
              $ebook_categories = $db->table('ebook_category')->get()->getResultArray();