app/Views/frontend/default-new/header_sm_device.php

              <div class="collapse" id="ebook-category-collapse">
                <ul class="btn-toggle-nav list-unstyled fw-normal pb-1 small bg-white pt-2">
                  <?php
                $ebook_categories = $db->table('ebook_category')->get()->getResultArray();
---
SELECT *
FROM `ebook_category`