app/Views/frontend/default-new/home_elegant.php

                    <a href="<?php echo site_url('home/courses'); ?>" class="btn lms1-btn-purple mb-32px"><?php echo get_phrase('Browse Courses'); ?></a>

                    <?php
                        $total_number_of_ratings = $db->table('rating')->countAllResults();

						$summation_row = $db->table('rating')
							->selectSum('rating')
							->get()
							->getRow();

						$summation_of_ratings = $summation_row->rating ?? 0;

						$latest_5_ratings = $db->table('rating')
							->orderBy('id', 'desc')
							->limit(5)
							->get()
							->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `rating`
SELECT SUM(`rating`) AS `rating`
FROM `rating`
SELECT *
FROM `rating`
ORDER BY `id` DESC
 LIMIT 5