app/Controllers/Home.php

	public function home()
	{
		$home = $this->db->table('home_pages')
			->where('status', 1)
			->get()
			->getRowArray();
---
SELECT *
FROM `home_pages`
WHERE `status` = 1