app/Models/Crud_model.php

    public function get_categories($param1 = "")
    {
        $builder = $this->qb('category');

        if ($param1 !== "") {
            $builder->where('id', $param1);
        }

        return $builder->where('parent', 0)->get();
---
SELECT *
FROM `category`
WHERE `parent` = 0

    public function get_category_details_by_id($id)
    {
        return $this->db->table('category')->where(array('id' => $id))->get();
---
SELECT *
FROM `category`
WHERE `id` = '5'

    public function get_sub_categories($parent_id = "")
    {
        return $this->db->table('category')->where(array('parent' => $parent_id))->get()->getResultArray();
---
SELECT *
FROM `category`
WHERE `parent` = '4'

    function get_top_categories($limit = "10", $category_column = "category_id")
    {
        return $this->qb('course')
            ->select($category_column . ", count(*) AS course_number", false)
            ->where('status', 'active')
            ->groupBy($category_column)
            ->orderBy('course_number', 'DESC')
            ->limit((int) $limit)
            ->get()
            ->getResultArray();
---
SELECT sub_category_id, count(*) AS course_number
FROM `course`
WHERE `status` = 'active'
GROUP BY `sub_category_id`
ORDER BY `course_number` DESC
 LIMIT 12

    function get_custom_pages($custom_page_id = '', $button_position = "")
    {
        $builder = $this->qb('custom_page');

        if ($custom_page_id > 0) {
            $builder->where('custom_page_id', $custom_page_id);
        }

        if ($button_position !== "") {
            $builder->where('button_position', $button_position);
        }

        return $builder->get();
---
SELECT *
FROM `custom_page`
WHERE `button_position` = 'header'

    public function get_seo_by_route($route)
    {
        return $this->qb('seo_fields')
            ->where('route', $route)
            ->get()
            ->getRow();
---
SELECT *
FROM `seo_fields`
WHERE `route` = 'index.php'