app/Models/User_model.php

SELECT *
FROM `users`
WHERE `id` = '73'
---
   public function get_all_user($user_id = 0)
	{
		$builder = $this->db->table('users');

		if ($user_id > 0) {
			$builder->where('id', $user_id);
		}

		return $builder->get();

SELECT *
FROM `users`
WHERE `id` = '73'
---
    public function get_user_image_url($user_id)
    {
        $user_profile_image = $this->db->table('users')->where(array('id' => $user_id))->get()->getRow()->image;